v = float(input("Ввведіть значення частоти в колі змінного струму(в Гц):"))
u = float(input("Ввведіть значення максимальну напругу в колі змінного струму(в В):"))
c = float(input("Ввведіть значення ємності в колі змінного струму(в 10⁻⁶ Ф):"))
r = float(input("Ввведіть значення активного опору в колі змінного струму(в Ом):"))
l = float(input("Ввведіть значення індуктивності в колі змінного струму(в Гн):"))
c /= 1000000
w = 2 * 3.14 * v
z = (r ** 2 + (w * l - 1 / (w * c)) ** 2) ** 0.5
im = u / z
print(f"Максимальне значення сили струму в колі {round(im, 3)} А.")
print(f"Значення спаду напруги на ємності {round(im / w / c, 3)} В.")
print(f"Значення спаду напруги на індуктивності {round(im * l * w, 3)} В.")
print(f"Значення спаду напруги на активному опорі {round(im * r, 3)} В.")