a = input('Використовувати значення похибок вимірювання за замовчуванням?(так/ні):')
if a.lower() == 'так':
    dm1 = float(input('Введіть похибку вимірювання маси тягарця №1(в 10^-3 кг):')) / 1000
    dm2 = float(input('Введіть похибку вимірювання маси тягарця №2(в 10^-3 кг):')) / 1000
    dl = float(input('Введіть похибку вимірювання довжини стержня(в 10^-3 м):')) / 1000
    dr = float(input('Введіть похибку вимірювання відстані від осі обертання до тягарця(в 10^-3 м):')) / 1000
else:
    dm1 = 0.0005
    dm2 = 0.0005
    dl = 0.0005
    dr = 0.0005
    
m1 = float(input('Введіть масу тягарця №1(в 10^-3 кг):')) / 1000
m2 = float(input('Введіть масу тягарця №2(в 10^-3 кг):')) / 1000
l = float(input('Введіть довжину стержня(в 10^-3 м):')) / 1000
r = float(input('Введіть відстань від осі обертання до тягарця(в 10^-3 м):')) / 1000
i = 1 / 6 * m1 * l**2 + 4 * m2 * r**2 * 100
di = 1 / 6 * dm1 * l**2 + 1 / 3 * m1 * l * dl + 4 * dm2 * r**2 + 8 * m2 * r * dr * 100
e = di / i * 100
print(f'Момент інерції: {i} 10^-2 кг*м^2')
print(f'Похибка моменту інерції {di} 10^-2 кг*м^2')
print(f'Відносна похибка: {e}')
