a0 = float(input("Введіть значення сили струму кола постійного струму з під'єднаною котушкою(в А):"))
u0 = float(input("Введіть значення напруги кола постійного струму з під'єднаною котушкою(в В):"))

a1 = float(input("Введіть значення сили струму кола змінного струму з під'єднаною котушкою(в А):"))
u1 = float(input("Введіть значення напруги кола змінного струму з під'єднаною котушкою(в В):"))

a2 = float(input("Введіть значення сили струму кола змінного струму з під'єднаним конденсатором(в А):"))
u2 = float(input("Введіть значення напруги кола змінного струму з під'єднаним конденсатором(в В):"))

a3 = float(input("Введіть значення сили струму кола змінного струму з під'єднаними послідовно котушкою і конденсатором(в А):"))
u3 = float(input("Введіть значення напруги кола змінного струму з під'єднаними послідовно котушкою і конденсатором(в В):"))

amax = float(input("Введіть верхню межу значення сили струму вимірювального приладу(в А):"))
umax = float(input("Введіть верхню межу значення напруги вимірювального приладу(в В):"))

r0 = u0 / a0
r1 = u1 / a1
r2 = u2 / a2
if r0 > r1:
    print("Введені значення не коректні! Помилка при вимірюванні значеннь кола з під'єднаною котушкою.")
else:
    L = (r1 ** 2 - r0 ** 2) ** 0.5 / (2 * 3.14 * 50)
    c = 1 / (2 * 3.14 * 50 * r2)
    z1 = u3 / a3
    z2 = (r0 ** 2 + ((r1 ** 2 - r0 ** 2) ** 0.5 - r2) ** 2) ** 0.5
    dz1 = (umax * 0.5 / (100 * u3) + amax * 0.5 / (100 * a3)) * z1

print(f"Омічний опір котушки: R₀ = {r0} Ом")
print(f"Повний опір котушки: R₁ = {r1} Ом")
print(f"Індуктивність котушки: L =  {L} Гн")
print(f"Реактивний опір конденсатора: R₂ = {r2} Ом")
print(f"Ємність конденсатора: C = {c} Ф")
print(f"Повний опір RLC-з'єднання: Z₁ = {z1} Ом")
print(f"Повний опір RLC-з'єднання: Z₂ = {z2} Ом")
print(f"Похибка повного опору RLC-з'єднання: ΔZ₁ = {dz1} Ом")