a = input('Використовувати значення похибок вимірювання за замовчуванням?(так/ні):')
if a.lower() == 'так':
    dm = float(input('Введіть похибку вимірювання маси тягарця №1(в 10^-3 кг):')) / 1000
    dh = float(input('Введіть похибку вимірювання відстані, що проходить тягарець при опусканні(в 10^-3 м):')) / 1000
else:
    dm = 0.0005
    dh = 0.0005
    
m = float(input('Введіть масу тягарця(в 10^-3 кг):')) / 1000
h = float(input('Введіть відстань, що проходить тягарець при опусканні(в 10^-3 м):')) / 1000
d1 = float(input('Введіть діаметр шківа №1(в 10^-3 м):')) / 1000
d2 = float(input('Введіть діаметр шківа №2(в 10^-3 м):')) / 1000
d3 = float(input('Введіть діаметр шківа №3(в 10^-3 м):')) / 1000
t1 = float(input('Введіть час опускання тягарця №1(в с):'))
t2 = float(input('Введіть час опускання тягарця №2(в с):'))
t3 = float(input('Введіть час опускання тягарця №3(в с):'))
ds = (d1 + d2 + d3) / 3
ts = (t1 + t2 + t3) / 3
dd1 = abs(ds-d1)
dd2 = abs(ds-d2)
dd3 = abs(ds-d3)
dt3 = abs(ts-t3)
dt2 = abs(ts-t2)
dt1 = abs(ts-t1)
dds = (dd1 + dd2 + dd3) / 3
dts = (dt1 + dt2 + dt3) / 3
i = (m * ds**2 / 4 * ((9.8 * ts**2) / (2 * h) - 1)) * 100
e = (dm / m + 2 * dds / ds + (9.8 * 2 * dts + 2 * dh) / (9.8 * ts**2 - 2 * h) + dh/h) * 100
di = e * i / 100
print(f'Δd1={dd1*1000} 10^-3 м, Δd2={dd2*1000} 10^-3 м, Δd3={dt3*1000} 10^-3 м, Δds={dds*1000} 10^-3 м')
print(f'Δt1={dt1} с, Δt2={dt2} с, Δt3={dt3} с, Δts={dts} с')
print(f'Момент інерції: {i} 10^-2 кг*м^2')
print(f'Похибка моменту інерції {di} 10^-2 кг*м^2')
print(f'Відносна похибка: {e}')
