n = float(input("Введіть кількість штрихів на 1 мм дифракційної ґратки(число):"))
l = float(input("Введіть відстань між екраном і дифракційною ґраткою(в 10^-3 м):"))
k = float(input("Введіть порядок дифракційного максимуму(число):"))
x1 = float(input("Введіть відстань на екрані між максимумами однакового порядку отриману при 1-ому вимірюванні(в 10^-3 м):"))
x2 = float(input("Введіть відстань на екрані між максимумами однакового порядку отриману при 2-ому вимірюванні(в 10^-3 м):"))
x3 = float(input("Введіть відстань на екрані між максимумами однакового порядку отриману при 3-ому вимірюванні(в 10^-3 м):"))
d = 1 / n * 1000
lambda1 = x1 * d / 2 / k / l
lambda2 = x2 * d / 2 / k / l
lambda3 = x3 * d / 2 / k / l
lambdas = (lambda3 + lambda2 + lambda1) / 3
dlambda1 = lambdas - lambda1
dlambda2 = lambdas - lambda2
dlambda3 = lambdas - lambda3
dlambdas = (dlambda3 + dlambda2 + dlambda1) / 3
e = dlambdas / lambdas * 100
print(f"Стала дифракційної ґратки d = {d} м.")
print(f"Середнє значення довжини світлової хвилі {lambdas} 10^-9 м.")
print(f"Значення похибки  довжини світлової хвилі при 1-ому вимірюванні {dlambda1} 10^-9 м.")
print(f"Значення похибки  довжини світлової хвилі при 2-ому вимірюванні {dlambda2} 10^-9 м.")
print(f"Значення похибки  довжини світлової хвилі при 3-ому вимірюванні {dlambda3} 10^-9 м.")
print(f"Середнє значення похибки  довжини світлової хвилі{dlambdas} 10^-9 м.")
print(f'Відносна похибка: {e}')
