"""1.33. Матеріальна точка рухається прямолінійно.
Рівняння руху має вигляд  x=2+t-0,5t^3, де час – в секундах, шлях – в метрах.
Знайдіть швидкість і прискорення точки в моменти часу 0 с і 3 с.
Знайти середню швидкість і середнє прискорення за перші три секунди руху."""

print("""1.33. Матеріальна точка рухається прямолінійно.
Рівняння руху має вигляд  x=2+t-0,5t^3, де час – в секундах, шлях – в метрах.
Знайдіть швидкість і прискорення точки в моменти часу 0 с і 3 с.
Знайти середню швидкість і середнє прискорення за перші 3 секунди руху.""")

print('Ви повинні ввести дані для рівняння руху вигляду x=x0+a*t+b*t^c')
x0 = float(input('Введіть початкову кооринату:'))
a = float(input('Введіть перший коефіцієнт:'))
b = float(input('Введіть другий коефіцієнт:'))
c = int(input('Введіть третій коефіцієнт:'))
t0 = float(input('Введіть перший момент часу:'))
t1 = float(input('Введіть другий момент часу:'))

v1 = a + b * c * t0 ** (c - 1)
v2 = a + b * c * t1 ** (c - 1)
a1 = b * (c - 1) * c * t0 ** (c - 2)
a2 = b * (c - 1) * c * t1 ** (c - 2)

vs = (x0 + a * t1 + b * t1 ** c) - (x0 + a * t0 + b * t0 ** c)
aser = (v2 - v1) / (t1 - t0)
print(f'a1={a1} м/с^2, a2={a2} м/с^2, v1={v1} м/с, v2={v2} м/с, <v>={vs} м/с, <a>={aser} м/с^2')
