//17.13. За допомогою співвідношення невизначеностей оцініть мінімальну кінетичну енергію електрона, локалізованого в області розміром 0,10 нм.
#include <iostream>
#include <clocale>

using namespace std;

int main()
{
    setlocale(LC_CTYPE, "ukr");

    double h = 6.626e-34;       // Стала Планка 
    double m = 9.11e-31;        // Маса електрона 
    double pi = 3.1415926535;   // Число пі

    double dx_nm;

    cout << "Оцінка мінімальної кінетичної енергії електрона:" << endl;

    cout << "Введіть розмір області локалізації dx (нм): ";
    cin >> dx_nm;

    if (dx_nm <= 0) {
        cout << "Розмір області повинен бути додатним, а не від'ємним";
        system("pause");
        return 1;
    }

    // Переведення нанометрів у метри
    double dx = dx_nm / 1e9;

    // Обчислення сталої Дірака
    double hbar = h / (2.0 * pi);

    // Обчислення мінімальної кінетичної енергії
    double E_k = (hbar * hbar) / (2.0 * m * dx * dx);

    // Виведення результатів
    cout << "Мінімальна кінетична енергія електрона Ek = " << E_k << " Дж" << endl;

    system("pause");
    return 0;
}
