import math

# прискорення вільного падіння
GRAVITY = 9.8

def main():
    print("==================================================")
    print("   Калькулятор максимальної швидкості на повороті")
    print("   Формула: v = sqrt(mu * g * R)")
    print("   (Щоб вийти, введіть 'exit' або 'q')")
    print("==================================================")

    while True:
        print("\n--- Новий розрахунок ---")
        
        # 1.  радіус
        user_input_R = input("Введіть радіус повороту (метри): ")
        
        # Перевірка 
        if user_input_R.lower() in ['exit', 'q', 'вихід']:
            break
            
        # 2. коефіцієнт тертя
        user_input_mu = input("Введіть коефіцієнт тертя (додатнє): ")
        
        # Перевірка 
        if user_input_mu.lower() in ['exit', 'q', 'вихід']:
            break

        try:
            # Конвертуємо введені рядки у числа
            R = float(user_input_R)
            mu = float(user_input_mu)

            # Перевірка даних (не можуть бути від'ємними)
            if R <= 0 or mu <= 0:
                print("Помилка: Радіус та коефіцієнт тертя мають бути більше нуля!")
                continue # Починаємо цикл заново

            # 3. Обчислення
            v_ms = math.sqrt(mu * GRAVITY * R)
            v_kmh = v_ms * 3.6

            # 4. Виведення результату
            print(f"Result -> Максимальна швидкість: {v_ms:.2f} м/с")
            print(f"Result -> У кілометрах за годину: {v_kmh:.2f} км/год")

        except ValueError:
            # Цей блок спрацює, якщо користувач ввів не число
            print("Помилка вводу: Будь ласка, вводьте числа (використовуйте крапку для дробів).")

    print("\nПрограма завершена.")

if __name__ == "__main__":
    main()
