//7.81. При ізотермічному процесі газ отримав 314 Дж тепла. Обчисліть зміну внутрішньої енергії газу та виконану ним роботу.

#include <iostream>
#include <clocale>

using namespace std;

int main()
{
    setlocale(LC_CTYPE, "ukr");

    double Q;

    cout << "Розрахунок зміни внутрішньої енергії та роботи газу:" << endl;

    cout << "Введіть кількість отриманого тепла Q (Дж): ";
    cin >> Q;

    if (Q <= 0) {
        cout << "Кількість тепла повинна бути додатна,а не від'ємна.\n";
        system("pause");
        return 1;
    }

    // Зміна температури для ізотермічного процесу дорівнює 0
    double delta_T = 0.0;

    // Обчислення зміни внутрішньої енергії газу
    double delta_U = 0.0;

    // Обчислення роботи, виконаної газом
    double A = Q - delta_U;

    // Виведення результатів
    cout << "Зміна внутрішньої енергії газу = " << delta_U << " Дж" << endl;
    cout << "Робота, виконана газом = " << A << " Дж" << endl;

    system("pause");
    return 0;
}
