//14.6 Діаметр вольфрамової спіралі в електричній лампі становить 0,3 мм, довжина спіралі 5 см. Під час вмикання лампи в мережу з напругою 127 В через неї тече струм 0,31 А. Визначте температуру спіралі. Вважайте, що при встановленні рівноваги вся енергія втрачається в результаті випромінювання. Відношення енергетичних світностей вольфраму та абсолютно чорного тіла для цієї температури прийміть рівним 0,31.

#include <iostream>
#include <cmath>
using namespace std;
int main()
{
    double d, l, U, I, alpha;
    const double pi = 3.1415926535;
    const double sigma = 5.67e-8; // стала Стефана-Больцмана
    cout << "Введіть діаметр спіралі d (мм): ";
    cin >> d;
    if (d <= 0) {
        cout << "Помилка! Діаметр повинен бути додатним!\n";
        return 1;
    }
    cout << "Введіть довжину спіралі l (см): ";
    cin >> l;
    if (l <= 0) {
        cout << "Помилка! Довжина повинна бути додатною!\n";
        return 1;
    }
    cout << "Введіть напругу U (В): ";
    cin >> U;
    if (U <= 0) {
        cout << "Помилка! Напруга повинна бути додатною!\n";
        return 1;
    }
    cout << "Введіть силу струму I (А): ";
    cin >> I;

    if (I <= 0) {
        cout << "Помилка! Сила струму повинна бути додатною!\n";
        return 1;
    }

    cout << "Введіть alpha: ";
    cin >> alpha;
    if (alpha <= 0 || alpha > 1) {
        cout << "Помилка! alpha повинна бути в межах від 0 до 1!\n";
        return 1;
    }

    // Переведення в СІ
    d = d * pow(10, -3); // мм у м
    l = l * pow(10, -2); // см у м

    // Площа бічної поверхні спіралі
    double S = pi * d * l;

    // Потужність струму
    double P = U * I;

    // P = alpha * sigma * S * T^4
    double T = pow(P / (alpha * sigma * S), 1.0 / 4.0);

    cout << "\nТемпература спіралі T = " << T << " K" << endl;

    return 0;
}