print("""Потужність випромінювання абсолютно чорного тіла становить x кВт.
Визначте площу випромінюючої поверхні тіла, якщо відомо, що довжина хвилі, на яку 
припадає максимум спектральної густини його енергетичної світності, становить y нм.\n""")
x = float(input("Введіть значчення потужність випромінювання абсолютно чорного тіла (в кВт)")) * 1000
y = float(input("""Введіть значчення довжини хвилі, на яку припадає максимум 
спектральної густини енергетичної світності абсолютно чорного тіла (в нм)""")) / 1000000000
s = round((x * (y ** 4)) / (5.67 / 100000000 * ((3 / 1000) ** 4)), 8)
print(f"Площа випромінюючої поверхні тіла S = {s} м².")
