//17.9. Знайдіть довжину хвилі де Бройля для альфа-частинки, яка рухається по колу з радіусом 10,0 мм в магнітному полі з індукцією 2,00 мТл.
#include <iostream>
#include <clocale>

using namespace std;

int main()
{
    setlocale(LC_CTYPE, "ukr");

    double h = 6.626e-34;       // Стала Планка 
    double q = 2.0 * 1.602e-19; // Заряд альфа-частинки

    double R_mm, B_mtl;

    cout << "Розрахунок довжини хвилі де Бройля для альфа-частинки:" << endl;

    cout << "Введіть радіус кола R (мм): ";
    cin >> R_mm;

    cout << "Введіть індукцію магнітного поля B (мТл): ";
    cin >> B_mtl;

    if (R_mm <= 0 || B_mtl <= 0) {
        cout << "Введені дані повинні бути додатними, а не від'ємними." << endl;
        system("pause");
        return 1;
    }

    // Переведення у системні одиниці (СІ)
    double R = R_mm / 1000.0;
    double B = B_mtl / 1000.0;

    // Обчислення довжини хвилі де Бройля
    double lambda = h / (q * B * R);

    // Виведення результатів
    cout << "Довжина хвилі де Бройля lambda = " << lambda << " м" << endl;

    system("pause");
    return 0;
}
