import math

# Дано:
m = 0.0001     # маса (грами перевів у кілограми)
L = 0.2        # довжина (см перевів у метри)
kut_grad = 30  # кут у градусах
g = 9.81       # прискорення вільного падіння
k = 9e9        # коефіцієнт Кулона (9 * 10^9)

# Переводимо кут у радіани 
kut_rad = math.radians(kut_grad)

# 1. Радіус кола, на якому висять кульки
R = L * math.sin(kut_rad)

# 2. Відстань між кульками (сторона рівностороннього трикутника)
# r = R * sqrt(3)
r = R * math.sqrt(3)

# 3. Сумарна електрична сила, яка має діяти на кульку для такого кута
# F_el = m * g * tan(alpha)
F_el = m * g * math.tan(kut_rad)

# 4. Виводимо формулу для заряду q
# Оскільки F_el = sqrt(3) * k * q^2 / r^2
# q = sqrt( (F_el * r^2) / (k * sqrt(3)) )
chiselnik = F_el * (r**2)
znamennyk = k * math.sqrt(3)
q = math.sqrt(chiselnik / znamennyk)

# Вивід результатів
print("Потрібний заряд однієї кульки:")
print(f"{q:.10f} Кл")
# Для зручності виведемо у нанокулонах (нКл)
print(f"{q * 1e9:.2f} нКл")