// 15.28. В імпульсі тривалістю 0,13 мс лазер випромінює промінь світла з енергією 10 Дж. Визначити середній тиск такого світлового імпульсу, якщо його фокусують у пляму з діаметром 10 мкм на поверхню, перпендикулярну до променя, яка має коефіцієнт відбивання 0,5.

#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    double dt, W, d, rho;
    const double pi = 3.1415926535;
    const double c = 3e8; // швидкість світла, м/с
    cout << "Введіть тривалість імпульсу dt (мс): ";
    cin >> dt;

    if (dt <= 0) {
        cout << "Помилка! Тривалість імпульсу повинна бути додатною!\n";
        return 1;
    }

    cout << "Введіть енергію імпульсу W (Дж): ";
    cin >> W;
    if (W <= 0) {
        cout << "Помилка! Енергія повинна бути додатною!\n";
        return 1;
    }

    cout << "Введіть діаметр плями d (мкм): ";
    cin >> d;

    if (d <= 0) {
        cout << "Помилка! Діаметр повинен бути додатним!\n";
        return 1;
    }

    cout << "Введіть коефіцієнт відбивання rho: ";
    cin >> rho;

    if (rho < 0 || rho > 1) {
        cout << "Помилка! Коефіцієнт відбивання повинен бути від 0 до 1!\n";
        return 1;
    }

    // Переведення в СІ
    dt = dt * pow(10, -3); // мс у с
    d = d * pow(10, -6);   // мкм у м

    // Площа плями
    double S = pi * pow(d, 2) / 4;

    // Середня інтенсивність світла
    double J = W / (dt * S);

    // Тиск світла
    double p = (J / c) * (1 + rho);

    cout << "\nСередній тиск світлового імпульсу p = "
        << p << " Па" << endl;

    return 0;
}